Revit 2027 API
Dimension.IsTextPositionAdjustable Method
 Indicates if this dimension is supported to set/get TextPosition/LeaderEndPosition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsTextPositionAdjustable()
Public Function IsTextPositionAdjustable As Boolean
public:
bool IsTextPositionAdjustable()
member IsTextPositionAdjustable : unit -> bool
Return Value
Boolean
See Also
Reference
Dimension Class
Autodesk.Revit.DB Namespace